//src/data/tests.ts
import { TestDetails } from '@/types'

export const TESTS: TestDetails[] = [
  {
    id: 'depression-test',
    title: 'Тест на депресію',
    description: 'Оцінка емоційного стану',
    questionsCount: 5, 
    questions: [
      {
        id: 1,
        text: "Як часто ви відчуваєте смуток?",
        answers: [
          { id: 1, text: "Ніколи", score: 0 },
          { id: 2, text: "Інколи", score: 1 },
          { id: 3, text: "Часто", score: 2 }
        ]
      },
        {
            id: 2,
            text: "Як часто ви втрачаєте інтерес до речей, які раніше вам подобалися?",
            answers: [
            { id: 1, text: "Ніколи", score: 0 },
            { id: 2, text: "Інколи", score: 1 },
            { id: 3, text: "Часто", score: 2 }
            ]
        },
        {
            id: 3,
            text: "Как часто вы чувствуете усталость или недостаток энергии?",
            answers: [
            { id: 1, text: "Никогда", score: 0, recommendations: ["Продолжайте поддерживать свой энергетический баланс!"] },
            { id: 2, text: "Иногда", score: 1, recommendations: ["Попробуйте добавить легкие физические нагрузки","Следите за режимом питания"   ] },
            { id: 3, text: "Часто", score: 2,recommendations: ["Проверьте уровень витамина D","Рассмотрите возможность консультации с врачом", "Уменьшите потребление кофеина"
      ] }
            ]
        },
        {
            id: 4,
            text: "test4",
            answers: [
            { id: 1, text: "Никогда", score: 0 },
            { id: 2, text: "Иногда", score: 1 },
            { id: 3, text: "Часто", score: 2 }
            ]
        },{
            id: 5,
            text: "test5",
            answers: [
            { id: 1, text: "Никогда", score: 0 },
            { id: 2, text: "Иногда", score: 1 },
            { id: 3, text: "Часто", score: 2 }
            ]
        },
    ]
  },
  {
    id: 'anxiety-test',
    title: 'Тест на тривожність',
    description: 'Оцінка рівня тривожності',
    questionsCount: 5,
    questions: [
      {
        id: 1,
        text: "Как часто вы чувствуете тревогу?",
        answers: [
          { id: 1, text: "Никогда", score: 0 },
          { id: 2, text: "Иногда", score: 1 },
          { id: 3, text: "Часто", score: 2 }
        ]
      },
        {
            id: 2,
            text: "Как часто вы теряете интерес к вещам, которые раньше вам нравились?",
            answers: [
            { id: 1, text: "Никогда", score: 0 },
            { id: 2, text: "Иногда", score: 1 },
            { id: 3, text: "Часто", score: 2 },
            ]
        },
        {
            id: 3,
            text: "Как часто вы чувствуете усталость или недостаток энергии?",
            answers: [
            { id: 1, text: "Никогда", score: 0 },
            { id: 2, text: "Иногда", score: 1 },
            { id: 3, text: "Часто", score: 2 }
            ]
        },
        {
            id: 4,
            text: "test4",
            answers: [
            { id: 1, text: "Никогда", score: 0 },
            { id: 2, text: "Иногда", score: 1 },
            { id: 3, text: "Часто", score: 2 }
            ]
        },{
            id: 5,
            text: "test5",
            answers: [
            { id: 1, text: "Никогда", score: 0 },
            { id: 2, text: "Иногда", score: 1 },
            { id: 3, text: "Часто", score: 2 }
            ]
        },
    ]
  },
  {
    id: 'panic-disorder-test',
    title: 'Тест на панічний розлад (PDSS-SR)',
    description: 'Оцінка симптомів панічного розладу',
    questionsCount: 5,
    questions: [
      {
        id: 1,
        text: "Скільки панічних атак або нападів з обмеженими симптомами ви пережили за тиждень?",
        answers: [
          { id: 1, text: "Немає панічних атак або епізодів з обмеженими симптомами", score: 0 },
          { id: 2, text: "Легко: немає повноцінних панічних атак і не більше 1 нападу з обмеженими симптомами на день", score: 1 },
          { id: 3, text: "Помірно: 1–2 повноцінні панічні атаки та/або кілька нападів з обмеженими симптомами на день", score: 2 },
          { id: 4, text: "Значно: більше 2 повноцінних атак, але в середньому не частіше 1 на день", score: 3 },
          { id: 5, text: "Крайньо: панічні атаки траплялися частіше 1 разу на день більшість днів", score: 4 }
        ]
      },
      {
        id: 2,
        text: "Як тривожними (некомфортними, страшними) були ці атаки під час їх переживання?",
        answers: [
         { id: 1, text: "Зовсім не тривожно, або атак не було", score: 0 },
          { id: 2, text: "Слабка тривога (не дуже інтенсивно)", score: 1 },
          { id: 3, text: "Помірна тривога (інтенсивно, але можна контролювати)", score: 2 },
          { id: 4, text: "Сильна тривога (дуже інтенсивно)", score: 3 },
          { id: 5, text: "Надзвичайно тривожно (нестерпний дискомфорт під час усіх атак)", score: 4 }
        ]
      },
      {
        id: 3,
        text: "Наскільки ви хвилювалися або відчували тривогу через можливість нових панічних атак або через побоювання, пов’язані з ними(наприклад, що вони можуть бути ознакою фізичних/психічних проблем або призвести до соціального дискомфорту)?",
        answers: [
         { id: 1, text: "Зовсім не хвилювався", score: 0 },
          { id: 2, text: "Іноді або незначно", score: 1 },
          { id: 3, text: "Часто або помірно", score: 2 },
          { id: 4, text: "Дуже часто або до болючого ступеня", score: 3 },
          { id: 5, text: "Майже постійно, що повністю дезорганізує життя", score: 4 }
        ]
      },
      {
        id: 4,
        text: "Чи уникали ви за минулий тиждень місць або ситуацій(наприклад, громадський транспорт, кінотеатри, натовп, мости, магазини, перебування наодинці) через страх панічної атаки?Чи боялися б ви таких ситуацій, якби вони виникли?",
        answers: [
          { id: 1, text: "Немає: без страху чи уникання", score: 0 },
          { id: 2, text: "Легко: рідкісний страх/уникання, але я міг долати ситуації. Майже без змін у способі життя", score: 1 },
          { id: 3, text: "Помірно: помітний страх/уникання, але керований. Уникав деяких ситуацій, але міг перебувати в них з кимось. Деякі зміни в житті, але функціонування не порушене", score: 2 },
          { id: 4, text: "Значно: сильне уникання. Суттєві зміни в житті, що ускладнюють звичні справи", score: 3 },
          { id: 5, text: "Крайньо: постійний страх/уникання. Радикальні зміни в житті, через які важливості залишаються невиконаними", score: 4 }
        ]
      },
      {
        id: 5,
        text: "Чи уникали ви діяльностей (фізичне напруження, секс, гарячий душ, кава, фільми жахів) через страх, що вони спровокують симптоми, схожі на панічні атаки?",
        answers: [
          { id: 1, text: "Немає уникання", score: 0 },
          { id: 2, text: "Легко: рідкісне уникання, майже без змін у житті", score: 1 },
          { id: 3, text: "Помірно: помітне уникання, але кероване. Обмежені зміни в житті", score: 2 },
          { id: 4, text: "Значно: майже повне уникання. Серйозні зміни в житті", score: 3 },
          { id: 5, text: "Крайньо: повне уникання. Життєві завдання не виконуються", score: 4 }
        ]
      },
      {
        id: 6,
        text: "Наскільки описані симптоми (атаки, тривога, уникання) заважали вашій роботі або домашнім обов’язкам? ",
        answers: [
          { id: 1, text: "Не заважали", score: 0 },
          { id: 2, text: "Незначно: майже все вдавалося робити", score: 1 },
          { id: 3, text: "Помітно: завдання давалися важче, але я справлявся", score: 2 },
          { id: 4, text: "Серйозно: багато важливого не вдалося зробити", score: 3 },
          { id: 5, text: " Повністю: неможливість виконувати будь-які обов’язки", score: 4 }
        ]
      },
      {
        id: 7,
        text: "Наскільки панічні атаки, напади з обмеженими симптомами, тривога про атаки та страх перед ситуаціями/діяльністю через них заважали вашому соціальному життю за останній тиждень?(Якщо у вас не було можливостей для спілкування, уявіть, як би ви почувалися, якби такі можливості були.)",
        answers: [
          { id: 1, text: "Жодного впливу", score: 0 },
          { id: 2, text: "Легко: немає повноцінних панічних атак і не більше 1 нападу з обмеженими симптомами на день", score: 1 },
          { id: 3, text: "Помірно: 1–2 повноцінні панічні атаки та/або кілька нападів з обмеженими симптомами на день", score: 2 },
          { id: 4, text: "Значно: більше 2 повноцінних атак, але в середньому не частіше 1 на день", score: 3 },
          { id: 5, text: "Крайньо: панічні атаки траплялися частіше 1 разу на день більшість днів", score: 4 }
        ]
      }
    ]
  }
]